module.exports = {
  // Модулі, які використовуються у тестах
  modules: ['vitest'],

  // Папка з тестами
  testPath: 'src/tests',

  // Патерн для файлів тестів
  testRegex: '\\.test\\.(js|jsx|ts|tsx)$',

  // Перелік файлів, які мають бути ігноровані
  ignore: ['node_modules'],

  // Параметри виконання тестів
  execute: {
    // Максимальна кількість одночасних тестів
    // Значення за замовчуванням: 5
    maxWorkers: 5,

    // Чи виводити в термінал повідомлення про виконання тесту
    // Значення за замовчуванням: true
    verbose: true,
  },
};
